#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for DEV Non-Live Deployment</summary>

```

terraform
aws_security_group.allow_tls: Refreshing state... [id=sg-028b9dea7a79ac792]
aws_api_gateway_rest_api.utils: Refreshing state... [id=gctqk6bw2j]
aws_s3_bucket.s3_audit_service_bucket: Refreshing state... [id=dev-s3-audit-service-deployment]
aws_iam_role.s3_audit_role: Refreshing state... [id=dev-s3-audit-role]
aws_iam_role_policy_attachment.s3_audit_lambda: Refreshing state... [id=dev-s3-audit-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_lambda_function.s3_audit_lambda: Refreshing state... [id=dev-s3-audit]
module.api_s3_audit_post.aws_api_gateway_resource.root: Refreshing state... [id=vgy4dw]
module.api_s3_audit_post.aws_api_gateway_method.proxy: Refreshing state... [id=agm-gctqk6bw2j-vgy4dw-POST]
module.api_s3_audit_post.aws_api_gateway_method_response.proxy: Refreshing state... [id=agmr-gctqk6bw2j-vgy4dw-POST-200]
aws_lambda_permission.s3_audit_api_gateway: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_lambda_alias.s3_audit_alias: Refreshing state... [id=arn:aws:lambda:eu-west-1:428452171461:function:dev-s3-audit:main]
module.api_s3_audit_post.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-gctqk6bw2j-vgy4dw-POST]
module.api_s3_audit_post.aws_api_gateway_deployment.deployment: Refreshing state... [id=f3u9br]
module.api_s3_audit_post.aws_api_gateway_integration_response.proxy: Refreshing state... [id=agir-gctqk6bw2j-vgy4dw-POST-200]
module.api_s3_audit_post.aws_api_gateway_stage.deployment: Refreshing state... [id=ags-gctqk6bw2j-dev]
aws_s3_bucket_versioning.s3_audit_service_bucket_versioning: Refreshing state... [id=dev-s3-audit-service-deployment]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.another_to_test will be created
  + resource "aws_security_group" "another_to_test" {
      + arn                    = (known after apply)
      + description            = "Test SG for pipeline"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "my_test_sg_a"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-c554eebc"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rgrhodesdev, Action: `pull_request`*